---
type: LoadedFamilyIntegrityCheck
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# LoadedFamilyIntegrityCheck

`Autodesk.Revit.DB.LoadedFamilyIntegrityCheck` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CheckAllFamilies | — | `public static bool CheckAllFamilies ( Document ADoc , ISet < ElementId > corruptFamilyIds )` |
| Method | CheckAllFamiliesSlow | — | `public static bool CheckAllFamiliesSlow ( Document ADoc , ISet < ElementId > corruptFamilyIds )` |
| Method | CheckFamily | — | `public static bool CheckFamily ( Document ADoc , ElementId familyId )` |